import ScooterSrc from '@assets/images/scooter.png';
import PanelSrc from '@assets/images/panel.png';

export const DESIGN_CARDS_INFO = [
    {
        title: 'Минималистичный дизайн',
        text: 'Рама, компоненты и аксессуары скутера выдержаны в едином стиле, где удобство пользователя выходит на первое место.  Одного прикосновения достаточно, чтобы запустить самокат.',
        imageSrc: ScooterSrc,
    },
    {
        title: 'Удобная панель управления',
        text: 'Удобно расположенные элементы управления. Отображение 8 типов данных в реальном времени: скорость, режим, заряд аккумулятора, состояние блокировки и другая информация.',
        imageSrc: PanelSrc,
    },
];

export const FAQ_ITEMS = [
    {
        question: 'На него нужны права категории M?',
        answer:
            'Продуманный угол рассеивания света позволяет сохранять хорошую видимость, не ослепляя других участников движения.',
    },
    {
        question: 'У меня вес 135 кг, выдержит ли этот самокат?',
        answer:
            'Самокат определенно выдержит и будет ехать, но не с максимальной скоростью.'
    },
    {
        question: 'Есть ли влагозащита?',
        answer:
            'Электросамокат имеет степень защиты IP54. Он защищен от попадания пыли и брызг, падающих в любом направлении. Погружение в воду может привести к поломке.'
    },
    {
        question: 'Это версия для Китая или Европы?',
        answer:
            'Это Европейская версия, со всеми обновлениями и евро-вилкой.'
    },
];
